choice_method = ''
while True:
    while choice_method != 'ExIt':
        choice = (input('Введите номер уровня (1-5): '))
        if choice == '1':
                print('Вы выбрали уровень 1, в нем вы познакомитесь с методами: upper, lower, capitalize')
                print('lower - нижний регистр, upper - верхний регистр, capitalize - делает первую букву заглавной, например: \n' \
                ' если ввести текст "пРиВет - МИР", то при использовании метода capitalize, текст будет выглядеть так: "Привет - мир", \n ' \
                'при использовании метода lower, текст будет выглядеть так: "привет - мир", при использовании метода upper, текст будет \n ' \
                'выглядеть так: "ПРИВЕТ - МИР"')
                choice_method = (input('Введите метод: '))
                if choice_method == 'upper':
                    word = input('Введите слово: ')
                    print(word.upper())
                if choice_method == 'lower':
                    word = input('Введите слово: ')
                    print(word.lower())
                if choice_method == 'capitalize':
                    word = input('Введите слово: ')
                    print(word.capitalize())
                if choice_method == 'ExIt':
                    break

        if choice == '2':
                print('Вы выбрали уровень 2, в нем вы познакомитесь с методами: find, replace, count, index')
                print('find - ищет подстроку в строке, если подстрока найдена, то возвращает индекс первого символа подстроки, \n' \
                'если не найдена, то возвращает -1, \n' \
                ' replace - заменяет подстроку на другую подстроку, count - считает количество вхождений подстроки в строку, index - ищет подстроку в строке, если подстрока \n '\
                'найдена, то возвращает индекс первого символа подстроки, \n' \
                'если не найдена, то возвращает ошибку, например: если ввести текст "Ботать это круто. Очень курто", то  при исполь зовании метода find и применения слова "круто", \n '\
                'то возвращает индекс первого символа подстроки, при использовании метода replace и применения слова "мощно" и "круто" программа вернет \n '\
                'Ботать это мощно. Очень мощно, при использовании метода count и применения слова "круто" программа вернет 2, при использовании метода index и применения слова "круто" \n '\
                'прграмма вернет индекс первого символа подстроки "круто"')
                choice_method = (input('Введите метод: '))
                if choice_method == 'find':
                    word = input('Введите слово: ')
                    sub_word = input('Введите подстроку: ')
                    print(word.find(sub_word))
                if choice_method == 'replace':
                    word = input('Введите слово: ')
                    sub_word = input('Введите подстроку, которую хотите заменить: ')
                    new_sub_word = input('Введите подстроку, на которую хотите заменить: ')
                    print(word.replace(sub_word, new_sub_word))
                if choice_method == 'count':
                    word = input('Введите слово: ')
                    sub_word = input('Введите подстроку: ')
                    print(word.count(sub_word))
                if choice_method == 'index':
                    word = input('Введите слово: ')
                    sub_word = input('Введите подстроку: ')
                    print(word.index(sub_word))
                if choice_method == 'ExIt':
                    break

        if choice == '3':
            print('Вы выбрали уровень 3, в нем вы познакомитесь с методами: split, join')
            print('split - разделяет строку на подстроки по указанному разделителю, join - объединяет подстроки \n' \
            'в строку по указанному разделителю, например: если ввести текст "Ботать это круто. Очень курто", то при \n' \
            'использовании метода split и применения разделителя " ", \n' \
            'то программа вернет список подстрок: ["Ботать", "это", "круто.", "Очень", "курто"], при использовании \n' \
            'метода join и применения разделителя ",", программа вернет строку: "Ботать,это,круто.,Очень,курто", например если \n' \
            'ввести текст "Ботать это круто. Очень курто", то при использовании метода split и применения разделителя " ", \n' \
            'то программа вернет список подстрок: ["Ботать", "это", "круто.", "Очень", "курто"], при использовании метода join и \n' \
            'применения разделителя ",", программа вернет строку: "Ботать,это,круто.,Очень,курто"')
            choice_method = (input('Введите метод: '))
            if choice_method == 'split':
                word = input('Введите слово: ')
                sub_word = input('Введите разделитель: ')
                print(word.split(sub_word))
            if choice_method == 'join':
                word = input('Введите слово: ')
                sub_word = input('Введите разделитель: ')
                print(sub_word.join(word))
            
        if choice == '4':
            print('Вы выбрали уровень 4, в нем вы познакомитесь с методами: isdigit, isalpha, strip, format, r, l, f')
            print('isdigit - проверяет, состоит ли строка только из цифр, isalpha - проверяет, состоит ли строка только из букв, \n' \
            'strip - удаляет пробелы в начале и в конце строки, format - форматирует строку, r - возвращает строку в обратном порядке, \n' \
            'l - возвращает строку в нижнем регистре, f - возвращает строку в верхнем регистре, например: если ввести текст "1234*&%^$", \n' \
            'то при использовании метода isdigit программа вернет True, при использовании метода isalpha программа вернет False, при \n' \
            'использовании метода strip и применение текста "1234", программа вернет "*&%^$", при использовании метода format и \n' \
            'применение текста 3,14159 и округлении до 2х знаков после запятой, программа вернет "3,14", при использовании метода r программа вернет '
            '"$%^&*4321", при использовании метода l программа вернет "1234*&%^$", при использовании метода f программа вернет "1234*&%^$"')
            choice_method = (input('Введите метод: '))
            if choice_method == 'isdigit':
                word = input('Введите слово: ')
                print(word.isdigit())
            if choice_method == 'isalpha':
                word = input('Введите слово: ')
                print(word.isalpha())
            if choice_method == 'strip':
                word = input('Введите слово: ')
                print(word.strip())
            if choice_method == 'format':
                word = input('Введите слово: ')
                print("{:.2f}".format(float(word)))
            if choice_method == 'r':
                word = input('Введите слово: ')
                print(word[::-1])
            if choice_method == 'l':
                word = input('Введите слово: ')
                print(word.lower())
            if choice_method == 'f':
                word = input('Введите слово: ')
                print(word.upper())

        if choice == '5':
            print('    pYtHon;is;AWESome    '.strip().replace(';', ' ').upper().capitalize())
